{
  "add_cross_attention": false,
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "anxiety",
    "1": "bipolar",
    "2": "depression",
    "3": "normal",
    "4": "personality disorder",
    "5": "stress",
    "6": "suicidal"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "anxiety": 0,
    "bipolar": 1,
    "depression": 2,
    "normal": 3,
    "personality disorder": 4,
    "stress": 5,
    "suicidal": 6
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "tie_word_embeddings": true,
  "transformers_version": "5.10.2",
  "type_vocab_size": 2,
  "use_cache": false,
  "vocab_size": 30522
}
